In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.arange(20).reshape(5,4)

In [4]:
index = ['A','B','C','D','E']

In [9]:
columns = ['W','Y','X','Z']

In [10]:
df = pd.DataFrame(data=data,index=index,columns=columns)

In [11]:
df

    W   Y   X   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [13]:
df.loc[['A','D'],['Y','Z']]

    Y   Z
A   1   3
D  13  15

In [14]:
df > 0

       W     Y     X     Z
A  False  True  True  True
B   True  True  True  True
C   True  True  True  True
D   True  True  True  True
E   True  True  True  True

In [15]:
df[df>0]

      W   Y   X   Z
A   NaN   1   2   3
B   4.0   5   6   7
C   8.0   9  10  11
D  12.0  13  14  15
E  16.0  17  18  19

In [16]:
df['X']>0

A    True
B    True
C    True
D    True
E    True
Name: X, dtype: bool

In [18]:
df[df['X']>0]['W']

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int64

In [19]:
df[df['X']>0].iloc[0]

W    0
Y    1
X    2
Z    3
Name: A, dtype: int64

In [23]:
df[(df['X']>1) & (df['Y']>4)]

    W   Y   X   Z
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [24]:
df[(df['X']>1) | (df['Y']>4)]

    W   Y   X   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19